---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Entity.Schema
source: html/fe5fb340-9386-06b2-37d3-c587208d8ba6.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.Schema Property

The Schema describing this Entity.

## Syntax (C#)
```csharp
public Schema Schema { get; }
```